Revit 2018 API
RebarUpdateCurvesData Properties
The RebarUpdateCurvesData type exposes the following members.
Properties
Name | Description
IsAttachmentTypeChanged
 Indicates if the attachment type has changed since the last regeneration.
IsBarsNumberChanged
 Indicates if the bar number has changed since the last regeneration.
IsBendingRadiusChanged
 Indicates if the style has changed since the last regeneration.
IsEndConstraintChanged
 Indicates if the end handle constraint has changed since the last regeneration.
IsLayoutChanged
 Indicates if the layout has changed since the last regeneration.
IsSpacingChanged
 Indicates if the spacing has changed since the last regeneration.
IsStartConstraintChanged
 Indicates if the start handle constraint has changed since the last regeneration.
IsStyleChanged
 Indicates if the style has changed since the last regeneration.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Spacing
 The spacing between the bars, according to the LayoutRule.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace